#+TITLE: Ollama Models Testing and Logging [WIP]
#+SETUPFILE: ./common-headers.org

# STATUS: Work in Progress
# Last Updated: 2025-02-03
# TODO:
# - Validate all model names once UV is working
# - Add specific token usage examples
# - Add more complex prompt examples
# - Add batch processing examples

* Setup and Configuration
First, let's ensure we have our proxy configuration set up correctly.

#+begin_src shell :llm t :results both :file ../data/proxy-config.txt :tangle ../data/proxy-config.sh
echo $HTTP_PROXY
echo $HTTPS_PROXY
#+end_src

#+RESULTS:
: http://host.docker.internal:8080
: http://host.docker.internal:8080

